### Some Basic Operation using map function
map work on Serise

In [1]:
import pandas as pd
import numpy as np

In [2]:
lis = [[1,2,3],[4,5,6],[7,8,9],[10,11,12]]
df = pd.DataFrame(data=lis,columns=["first","second","third"])
df

   first  second  third
0      1       2      3
1      4       5      6
2      7       8      9
3     10      11     12

In [3]:
# suppose if we want to add 2 each item in columns three then
df['third']=df['third'].map(lambda x: x+2)

In [4]:
df

   first  second  third
0      1       2      5
1      4       5      8
2      7       8     11
3     10      11     14

In [5]:
s = pd.Series(['cat', 'dog', np.nan, 'rabbit'])
s

0       cat
1       dog
2       NaN
3    rabbit
dtype: object

In [6]:
s.map({'cat': 'kitten', 'dog': 'puppy'})

0    kitten
1     puppy
2       NaN
3       NaN
dtype: object

In [7]:
df2 = pd.read_csv("nba.csv")
df2.head()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0

In [8]:
df2["Position"].value_counts()

SG    102
PF    100
PG     92
SF     85
C      78
Name: Position, dtype: int64

In [9]:
df3 = df2.copy()

In [10]:
df3["Position"] = df3["Position"].map({'SG':0,'PF':1,'PG':2,'SF':3,'C':4})

In [11]:
df3.head()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,2.0,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,3.0,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,0.0,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,0.0,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,1.0,29.0,6-10,231.0,NaN,5000000.0

In [12]:
df3.Position.value_counts()

0.0    102
1.0    100
2.0     92
3.0     85
4.0     78
Name: Position, dtype: int64

In [13]:
df3["Team"].unique()

array(['Boston Celtics', 'Brooklyn Nets', 'New York Knicks',
       'Philadelphia 76ers', 'Toronto Raptors', 'Golden State Warriors',
       'Los Angeles Clippers', 'Los Angeles Lakers', 'Phoenix Suns',
       'Sacramento Kings', 'Chicago Bulls', 'Cleveland Cavaliers',
       'Detroit Pistons', 'Indiana Pacers', 'Milwaukee Bucks',
       'Dallas Mavericks', 'Houston Rockets', 'Memphis Grizzlies',
       'New Orleans Pelicans', 'San Antonio Spurs', 'Atlanta Hawks',
       'Charlotte Hornets', 'Miami Heat', 'Orlando Magic',
       'Washington Wizards', 'Denver Nuggets', 'Minnesota Timberwolves',
       'Oklahoma City Thunder', 'Portland Trail Blazers', 'Utah Jazz',
       nan], dtype=object)

In [14]:
df3.Team.dtypes

dtype('O')

In [15]:
# Series generation 
gfg_string = 'geeksforgeeks'
gfg_series = pd.Series(list(gfg_string)) 
print("Original series\n" + gfg_series.to_string(index = False,header = False), end = '\n\n') 
   
# Using apply method for converting characters 
# present in the original series 
new_gfg_series = gfg_series.map(str.upper) 
print("Transformed series:\n" +new_gfg_series.to_string(index = False, header = False), end = '\n\n')

Original series
 g
 e
 e
 k
 s
 f
 o
 r
 g
 e
 e
 k
 s

Transformed series:
 G
 E
 E
 K
 S
 F
 O
 R
 G
 E
 E
 K
 S

In [16]:
df3

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,2.0,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,3.0,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,0.0,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,0.0,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,1.0,29.0,6-10,231.0,NaN,5000000.0
...,...,...,...,...,...,...,...,...,...
453,Shelvin Mack,Utah Jazz,8.0,2.0,26.0,6-3,203.0,Butler,2433333.0
454,Raul Neto,Utah Jazz,25.0,2.0,24.0,6-1,179.0,NaN,900000.0
455,Tibor Pleiss,Utah Jazz,21.0,4.0,26.0,7-3,256.0,NaN,2900000.0
456,Jeff Withey,Utah Jazz,24.0,4.0,26.0,7-0,231.0,Kansas,947276.0
457,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [17]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 458 entries, 0 to 457
Data columns (total 9 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      457 non-null    object
 1   Team      457 non-null    object
 2   Number    457 non-null    float64
 3   Position  457 non-null    float64
 4   Age       457 non-null    float64
 5   Height    457 non-null    object
 6   Weight    457 non-null    float64
 7   College   373 non-null    object
 8   Salary    446 non-null    float64
dtypes: float64(5), object(4)
memory usage: 32.3+ KB

In [18]:
df3.Name.dtypes

dtype('O')

In [19]:
len(df3["Name"][0])

13

In [20]:
df3["Name"].map(lambda a:len(str(a)))

0      13
1      11
2      12
3      11
4      13
       ..
453    12
454     9
455    12
456    11
457     3
Name: Name, Length: 458, dtype: int64

In [21]:
df3["Team"].map(lambda a:len(str(a)))

0      14
1      14
2      14
3      14
4      14
       ..
453     9
454     9
455     9
456     9
457     3
Name: Team, Length: 458, dtype: int64

### applymap
applymap use over the each and every elements in the dataframe

In [22]:
df3.applymap(lambda a:len(str(a)))

     Name  Team  Number  Position  Age  Height  Weight  College  Salary
0      13    14       3         3    4       3       5        5       9
1      11    14       4         3    4       3       5        9       9
2      12    14       4         3    4       3       5       17       3
3      11    14       4         3    4       3       5       13       9
4      13    14       3         3    4       4       5        3       9
..    ...   ...     ...       ...  ...     ...     ...      ...     ...
453    12     9       3         3    4       3       5        6       9
454     9     9       4         3    4       3       5        3       8
455    12     9       4         3    4       3       5        3       9
456    11     9       4         3    4       3       5        6       8
457     3     3       3         3    3       3       3        3       3

[458 rows x 9 columns]

In [23]:
information = {"Name":["Alamin Bhuyan","Fatema Akter","Mim Akter","Tania Akter"],"Age":[21,22,23,24]}
data_frame = pd.DataFrame(information)

In [24]:
data_frame

            Name  Age
0  Alamin Bhuyan   21
1   Fatema Akter   22
2      Mim Akter   23
3    Tania Akter   24

In [25]:
data_frame["Name"].map(lambda a:a[0:7])

0    Alamin
1    Fatema
2    Mim Akt
3    Tania A
Name: Name, dtype: object

In [26]:
data_frame.dtypes

Name    object
Age      int64
dtype: object

In [27]:
data_frame.Name.dtypes

dtype('O')

## Apply Method 
apply method use for Series and Dataframe both

In [28]:
information2 = {"Name":["Alamin Bhuyan","Fatema Akter","Mim Akter","Tania Akter"],"Age":[21,22,23,24],
              "Results":[80.7,70.6,61.8,71.8]}
data_frame2 = pd.DataFrame(information2)

In [29]:
data_frame2

            Name  Age  Results
0  Alamin Bhuyan   21     80.7
1   Fatema Akter   22     70.6
2      Mim Akter   23     61.8
3    Tania Akter   24     71.8

In [30]:
# this apply method use on the Series elements
data_frame2['Results'].apply(np.ceil)

0    81.0
1    71.0
2    62.0
3    72.0
Name: Results, dtype: float64

In [31]:
# this apply method use on the Series elements
data_frame2['Age'].apply(lambda x:x+2)

0    23
1    24
2    25
3    26
Name: Age, dtype: int64

In [32]:
# this apply method use on the DataFrame elements
data_frame2.apply(len)

Name       4
Age        4
Results    4
dtype: int64

In [33]:
data_frame2.apply(lambda a:str(a),axis=0)

Name       0    Alamin Bhuyan\n1     Fatema Akter\n2     ...
Age        0    21\n1    22\n2    23\n3    24\nName: Age,...
Results    0    80.7\n1    70.6\n2    61.8\n3    71.8\nNa...
dtype: object

In [34]:
data_frame2.dtypes

Name        object
Age          int64
Results    float64
dtype: object

### Some easy Example

In [35]:
data = pd.DataFrame(data={"start_year":[2001,2002,2005,2005,2006],
                         "end_year":[2002,2010,2008,2006,2014]})
data

   start_year  end_year
0        2001      2002
1        2002      2010
2        2005      2008
3        2005      2006
4        2006      2014

#### .map() applies function elements-wise in series

In [36]:
# create a function
def get_new_year(a):
    if a>2004:
        return a+10
    else:
        return a

In [37]:
# then map it to the series
data['start_year'].map(get_new_year)

0    2001
1    2002
2    2015
3    2015
4    2016
Name: start_year, dtype: int64

In [38]:
# We can do this using lambda function
data['start_year'].map(lambda a:a+10 if a>2004 else a)

0    2001
1    2002
2    2015
3    2015
4    2016
Name: start_year, dtype: int64

In [39]:
data['new_year'] = data['start_year'].map(get_new_year)

In [40]:
data

   start_year  end_year  new_year
0        2001      2002      2001
1        2002      2010      2002
2        2005      2008      2015
3        2005      2006      2015
4        2006      2014      2016

#### .apply() is like .map() but it works on row and columns basis on an entier DataFrame(specify the axis)

In [41]:
def get_difference(vector):
    difference = vector.max() - vector.min()
    return difference

In [47]:
data.apply(get_difference,axis=1)

0     1
1     8
2    10
3    10
4    10
dtype: int64

In [50]:
data['difference'] = data.apply(get_difference,axis=1)
data

   start_year  end_year  new_year  differenct  difference
0        2001      2002      2001        2001           1
1        2002      2010      2002        2002           8
2        2005      2008      2015        2005          10
3        2005      2006      2015        2005          10
4        2006      2014      2016        2006          10

In [51]:
data.pop('differenct')

0    2001
1    2002
2    2005
3    2005
4    2006
Name: differenct, dtype: int64

In [52]:
data

   start_year  end_year  new_year  difference
0        2001      2002      2001           1
1        2002      2010      2002           8
2        2005      2008      2015          10
3        2005      2006      2015          10
4        2006      2014      2016          10

In [46]:
# same function apply using lambda method
data.apply(lambda a:a.max() - a.min(),axis=0)

start_year     5
end_year      12
new_year      15
dtype: int64

### apply map change every value in the dataframe

In [53]:
data.applymap(lambda a:a/2)

   start_year  end_year  new_year  difference
0      1000.5    1001.0    1000.5         0.5
1      1001.0    1005.0    1001.0         4.0
2      1002.5    1004.0    1007.5         5.0
3      1002.5    1003.0    1007.5         5.0
4      1003.0    1007.0    1008.0         5.0